handsOn/flowOverCylinder/blockMeshSimple/Allrun
#!/bin/bash
#
# run the case

./meshIt

./run

./post
